SingleWheel/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           $internalField;
    }

    Tire_wall
    {
        type            rotatingWallVelocity;
        origin             (0.0 0.0 0.0);
        axis               (0 1 0);
        omega              constant -39.99; //-104.72;
        //value              uniform (0 -50 0); 

        /*
                type            movingWallVelocity;
        origin             (-0.965 0.290 1.01);
        //axis               (0 1 0);
        //omega              -172.413; //-104.72; //-172.413
        value              uniform (0 50 0); 
        */
    }
    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
